ryujou/Maurya-Source/esp32/lumia_esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
CONFIG_SECURE_BOOT_SIGNING_KEY="keys/maurya-release-signing-key.pem"
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_RMT_TX_ISR_CACHE_SAFE=y
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
# Maurya only exposes an IPv4 SoftAP at 192.168.4.1. Removing the unused IPv6
# stack keeps the signed image below the 90% OTA slot release gate.
CONFIG_LWIP_IPV6=n
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_PRINT_ERR_NAME=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=n
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
CONFIG_BT_NIMBLE_BAS_SERVICE=n
CONFIG_BT_NIMBLE_DIS_SERVICE=n
CONFIG_BT_NIMBLE_DTM_MODE_TEST=n
CONFIG_BT_NIMBLE_EXTRA_ADV_FIELDS=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_VFS_SUPPORT_DIR=n
CONFIG_LUMIA_BLE_DEVICE_NAME="Maurya"
CONFIG_LUMIA_MODE_BUTTON_GPIO=9
CONFIG_LUMIA_MODE_BUTTON_ACTIVE_LOW=y
CONFIG_LUMIA_MODE_BUTTON_DEBOUNCE_MS=30
CONFIG_LUMIA_MODE_BUTTON_LONG_PRESS_MS=2000
CONFIG_LUMIA_SLEEP_SWITCH_GPIO=4
CONFIG_LUMIA_SLEEP_SWITCH_ACTIVE_LOW=y
CONFIG_LUMIA_SLEEP_SWITCH_DEBOUNCE_MS=30
CONFIG_LUMIA_BLE_STATUS_LED_GPIO=8
CONFIG_LUMIA_BLE_STATUS_LED_ACTIVE_LOW=y
CONFIG_LUMIA_WIFI_AP_SSID_PREFIX="Maurya"
CONFIG_LUMIA_WIFI_AP_PASSWORD="CHANGE_ME_BEFORE_RELEASE"
CONFIG_LUMIA_WIFI_AP_AUTO_CHANNEL=y
CONFIG_LUMIA_WIFI_AP_CHANNEL=1
CONFIG_LUMIA_WIFI_AP_MAX_CLIENTS=2
CONFIG_LUMIA_WIFI_CAPTIVE_DNS=y
CONFIG_LUMIA_OTA_PROTOCOL_VERSION=2
CONFIG_LUMIA_OTA_LAYOUT_VERSION=2
CONFIG_LUMIA_OTA_ASSET_PACK_VERSION=1
CONFIG_LUMIA_OTA_WEB_VARIANT="multilingual"
CONFIG_LUMIA_OTA_SESSION_TIMEOUT_SECONDS=300
CONFIG_LUMIA_OTA_UPLOAD_TIMEOUT_SECONDS=20
CONFIG_LUMIA_LED_CH1_GPIO=0
CONFIG_LUMIA_LED_CH2_GPIO=1
CONFIG_LUMIA_LED_CH3_GPIO=3
CONFIG_LUMIA_LED_CH4_GPIO=7
CONFIG_LUMIA_LED_CH5_GPIO=10
CONFIG_LUMIA_LED_CH6_GPIO=20
CONFIG_LUMIA_LED_CH7_GPIO=21
CONFIG_LUMIA_LED_CH1_COUNT=6
CONFIG_LUMIA_LED_CH2_COUNT=6
CONFIG_LUMIA_LED_CH3_COUNT=6
CONFIG_LUMIA_LED_CH4_COUNT=6
CONFIG_LUMIA_LED_CH5_COUNT=6
CONFIG_LUMIA_LED_CH6_COUNT=6
CONFIG_LUMIA_LED_CH7_COUNT=6
CONFIG_LUMIA_LED_TX_PHYSICAL_MAX_COUNT=6
CONFIG_LUMIA_LED_TX_RESET_US=300
